7zip
a52dec
abseil-cpp
acl
ada
adobe-source-code-pro-fonts
adwaita-cursors
adwaita-icon-theme
adwaita-icon-theme-legacy
alsa-lib
alsa-topology-conf
alsa-ucm-conf
alsa-utils
aom
appstream
appstream-glib
apr
apr-util
arc-gtk-theme
archlinux-appstream-data
archlinux-keyring
archlinuxcn-keyring
aribb24
at-spi2-core
atkmm
attr
audit
autoconf
automake
avahi
ayatana-ido
base
bash
bash-completion
bc
bind
binutils
boost-libs
botan2
brotli
btrfs-progs
bubblewrap
bzip2
ca-certificates
ca-certificates-mozilla
ca-certificates-utils
cairo
cairomm
cairomm-1.16
cantarell-fonts
capitaine-cursors
cifs-utils
clash-for-windows-bin
clash-geoip
cmake
colord
coreutils
cppdap
cracklib
cronie
cryptsetup
curl
dav1d
db
db5.3
dbus
dbus-broker
dbus-broker-units
dbus-glib
dconf
dconf-editor
default-cursors
desktop-file-utils
device-mapper
dhcpcd
diffutils
dnssec-anchors
dosfstools
double-conversion
duktape
e2fsprogs
elementary-icon-theme
enchant
engrampa
exo
expat
faad2
fakeroot
fcitx5
fcitx5-chinese-addons
fcitx5-configtool
fcitx5-gtk
fcitx5-hangul
fcitx5-material-color
fcitx5-pinyin-zhwiki
fcitx5-qt
ffmpeg
ffmpeg4.4
fftw
file
filesystem
findutils
flac
fontconfig
freeglut
freetype2
fribidi
fuse-common
fuse3
garcon
gawk
gc
gcc
gcc-libs
gcr
gcr-4
gdbm
gdk-pixbuf2
gedit
gettext
ghc-libs
giflib
gist-lite
git
glib-networking
glib2
glibc
glibmm
glibmm-2.68
glslang
glu
gmp
gnome-keyring
gnome-themes-extra
gnulib-l10n
gnupg
gnutls
gobject-introspection-runtime
google-chrome
gperftools
gpgme
gpm
graphene
graphite
grep
groff
gsettings-desktop-schemas
gsettings-system-schemas
gsm
gspell
gssdp
gst-plugin-gtk
gst-plugins-bad-libs
gst-plugins-base-libs
gstreamer
gtest
gtk-layer-shell
gtk-update-icon-cache
gtk3
gtk4
gtkmm-4.0
gtkmm3
gtksourceview4
gtkspell3
guile
gupnp
gupnp-igd
gvfs
gvfs-smb
gzip
harfbuzz
harfbuzz-icu
haskell-aeson
haskell-assoc
haskell-attoparsec
haskell-base-compat
haskell-base-compat-batteries
haskell-base-orphans
haskell-bifunctors
haskell-comonad
haskell-contravariant
haskell-data-array-byte
haskell-data-fix
haskell-diff
haskell-distributive
haskell-dlist
haskell-erf
haskell-fgl
haskell-foldable1-classes-compat
haskell-generically
haskell-ghc-bignum-orphans
haskell-hashable
haskell-indexed-traversable
haskell-indexed-traversable-instances
haskell-integer-logarithms
haskell-onetuple
haskell-os-string
haskell-primitive
haskell-quickcheck
haskell-random
haskell-regex-base
haskell-regex-tdfa
haskell-scientific
haskell-semialign
haskell-semigroupoids
haskell-splitmix
haskell-statevar
haskell-strict
haskell-tagged
haskell-text-short
haskell-th-abstraction
haskell-these
haskell-time-compat
haskell-transformers-compat
haskell-unordered-containers
haskell-uuid-types
haskell-vector
haskell-vector-stream
haskell-witherable
hicolor-icon-theme
hidapi
highway
http-parser
hunspell
hwdata
hwloc
hyphen
iana-etc
icu
iproute2
iptables
iputils
iso-codes
jack2
jansson
jasper
jbigkit
jemalloc
jq
json-c
json-glib
jsoncpp
kbd
kcoreaddons
kdbusaddons
keyutils
kitemviews
kmod
krb5
kwidgetsaddons
l-smash
lame
lcms2
ldb
leancrypto
less
libadwaita
libaio
libappindicator-gtk3
libarchive
libass
libassuan
libasyncns
libatasmart
libavc1394
libavif
libayatana-indicator
libb2
libblockdev
libblockdev-crypto
libblockdev-fs
libblockdev-loop
libblockdev-mdraid
libblockdev-nvme
libblockdev-part
libblockdev-swap
libbluray
libbpf
libbs2b
libbsd
libbytesize
libcamera
libcamera-ipa
libcanberra
libcap
libcap-ng
libcdio
libcdio-paranoia
libcloudproviders
libcolord
libcups
libdaemon
libdatrie
libdbusmenu-glib
libdbusmenu-gtk3
libdca
libdecor
libdispatch
libdisplay-info
libdnet
libdovi
libdrm
libdvbpsi
libdvdnav
libdvdread
libebml
libedit
libelf
libepoxy
libevdev
libevent
libexif
libfabric
libffi
libfontenc
libgcrypt
libgedit-amtk
libgedit-gfls
libgedit-gtksourceview
libgedit-tepl
libgirepository
libgit2
libglvnd
libgpg-error
libgtop
libgudev
libgusb
libhandy
libhangul
libice
libidn
libidn2
libiec61883
libime
libimobiledevice
libimobiledevice-glue
libinih
libinput
libisl
libjpeg-turbo
libjxl
libkeybinder3
libksba
libldap
libmad
libmanette
libmatroska
libmaxminddb
libmd
libmfx
libmicrohttpd
libmm-glib
libmng
libmnl
libmodplug
libmpc
libmpcdec
libmpeg2
libmspack
libndp
libnetfilter_conntrack
libnewt
libnfnetlink
libnftnl
libnghttp2
libnghttp3
libnice
libnl
libnm
libnma
libnma-common
libnotify
libnsl
libnvme
libogg
libopenmpt
libp11-kit
libpamac-aur
libpcap
libpciaccess
libpeas
libpgm
libpipeline
libpipewire
libplacebo
libplist
libpng
libproxy
libpsl
libpulse
libpwquality
libraw1394
librsvg
libsamplerate
libsasl
libseccomp
libsecret
libsigc++
libsigc++-3.0
libsixel
libsm
libsndfile
libsodium
libsoup
libsoup3
libsoxr
libssh
libssh2
libstemmer
libsysprof-capture
libtar
libtasn1
libteam
libthai
libtheora
libtiff
libtirpc
libtool
libunibreak
libunistring
libunwind
libupnp
liburcu
liburing
libusb
libusbmuxd
libutf8proc
libuv
libva
libvdpau
libverto
libvlc
libvorbis
libvpl
libvpx
libwacom
libwbclient
libwebp
libwnck3
libx11
libxau
libxcb
libxcomposite
libxcrypt
libxcursor
libxcvt
libxdamage
libxdmcp
libxext
libxfce4ui
libxfce4util
libxfce4windowing
libxfixes
libxfont2
libxft
libxi
libxinerama
libxkbcommon
libxkbcommon-x11
libxkbfile
libxklavier
libxml2
libxmlb
libxmu
libxpm
libxpresent
libxrandr
libxrender
libxres
libxshmfence
libxslt
libxss
libxt
libxtst
libxv
libxxf86vm
libyaml
libyuv
licenses
lightdm
lightdm-gtk-greeter
lightdm-gtk-greeter-settings
linux-api-headers
linux-lts
llhttp
llvm-libs
lm_sensors
lmdb
lsb-release
lsof
lua
lua51
luajit
lvm2
lz4
lzo
m4
mailcap
make
man-db
man-pages
mariadb-libs
marisa
md4c
mdadm
meld
mesa
mesa-demos
minizip
mkinitcpio
mkinitcpio-busybox
mobile-broadband-provider-info
mousepad
mpdecimal
mpfr
mpg123
mpv
mtdev
mujs
ncurses
nettle
network-manager-applet
networkmanager
nm-connection-editor
npth
nspr
nss
numactl
ocl-icd
oniguruma
open-vm-tools
openal
opencc
opencore-amr
openh264
openjpeg2
openmpi
openpmix
openssh
openssl
openucx
opus
orc
p11-kit
pacman
pacman-contrib
pacman-mirrorlist
pacutils
pam
pamac-aur
pambase
pango
pangomm
pangomm-2.48
papirus-icon-theme
parted
patch
pavucontrol
pciutils
pcre
pcre2
pcsclite
perl
perl-clone
perl-encode-locale
perl-error
perl-file-listing
perl-html-parser
perl-html-tagset
perl-http-cookiejar
perl-http-cookies
perl-http-daemon
perl-http-date
perl-http-message
perl-http-negotiate
perl-io-html
perl-libwww
perl-lwp-mediatypes
perl-mailtools
perl-net-http
perl-timedate
perl-try-tiny
perl-uri
perl-www-robotrules
pinentry
pipewire
pixman
pkgconf
polkit
polkit-gnome
popt
portaudio
postfix
postfix-lmdb
postgresql-libs
procps-ng
protobuf
prrte
psmisc
pulseaudio
python
python-attrs
python-cairo
python-cffi
python-cryptography
python-dnspython
python-filelock
python-gobject
python-markdown
python-packaging
python-pip
python-pycparser
python-tqdm
python-wheel
qcustomplot
qhexedit2
qscintilla-qt5
qt5-base
qt5-declarative
qt5-svg
qt5-translations
qt5-wayland
qt5-x11extras
qt6-base
qt6-declarative
qt6-imageformats
qt6-positioning
qt6-svg
qt6-translations
qt6-wayland
qt6-webchannel
qt6-webengine
rav1e
re2
readline
rhash
ristretto
rnnoise
rtkit
rubberband
run-parts
s-nail
samba
sdl2-compat
sdl3
seahorse
sed
serf
shaderc
shadow
shared-mime-info
shellcheck
slang
smbclient
snappy
sound-theme-freedesktop
speex
speexdsp
spirv-tools
sqlcipher
sqlite
sqlitebrowser
srt
startup-notification
subversion
sudo
svt-av1
systemd
systemd-libs
systemd-sysvcompat
taglib
talloc
tar
tcl
tdb
telegram-desktop
tevent
thin-provisioning-tools
thunar
thunar-archive-plugin
thunar-shares-plugin
thunar-volman
thunderbird
thunderbird-i18n-zh-cn
tinysparql
tpm2-tss
tree
tslib
ttf-bitstream-vera
ttf-dejavu
ttf-liberation
ttf-opensans
tumbler
tzdata
uchardet
udisks2
unrar
unzip
upower
uriparser
usbmuxd
util-linux
util-linux-libs
v4l-utils
vapoursynth
vid.stab
vim
vim-runtime
visual-studio-code-bin
vlc
vmaf
volume_key
vte-common
vte3
vulkan-headers
vulkan-icd-loader
wayland
webkit2gtk
webrtc-audio-processing-1
wget
which
whois
woff2
wpa_supplicant
x264
x265
xarchiver
xcb-imdkit
xcb-proto
xcb-util
xcb-util-cursor
xcb-util-image
xcb-util-keysyms
xcb-util-renderutil
xcb-util-wm
xdg-dbus-proxy
xdg-utils
xf86-input-libinput
xf86-input-vmmouse
xf86-video-vmware
xfce4-appfinder
xfce4-indicator-plugin
xfce4-notifyd
xfce4-panel
xfce4-power-manager
xfce4-pulseaudio-plugin
xfce4-screensaver
xfce4-session
xfce4-settings
xfce4-terminal
xfconf
xfdesktop
xfsprogs
xfwm4
xfwm4-themes
xkeyboard-config
xmlsec
xorg-fonts-encodings
xorg-iceauth
xorg-server
xorg-server-common
xorg-setxkbmap
xorg-xauth
xorg-xdpyinfo
xorg-xev
xorg-xinit
xorg-xkbcomp
xorg-xmodmap
xorg-xprop
xorg-xrdb
xorg-xset
xorgproto
xvidcore
xxhash
xz
yay
zeromq
zimg
zip
zlib
zsh
zstd
